In [23]:
import pandas as pd
import numpy as np


import sklearn
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score

In [2]:
sal = pd.read_csv('Salary_dataset.csv')

In [3]:
sal.head()

   Unnamed: 0  YearsExperience   Salary
0           0              1.2  39344.0
1           1              1.4  46206.0
2           2              1.6  37732.0
3           3              2.1  43526.0
4           4              2.3  39892.0

In [5]:
sal.drop(columns=['Unnamed: 0'], axis=1, inplace=True)

In [6]:
sal.head()

   YearsExperience   Salary
0              1.2  39344.0
1              1.4  46206.0
2              1.6  37732.0
3              2.1  43526.0
4              2.3  39892.0

In [7]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 608.0 bytes

In [9]:
sal.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.413333   76004.000000
std           2.837888   27414.429785
min           1.200000   37732.000000
25%           3.300000   56721.750000
50%           4.800000   65238.000000
75%           7.800000  100545.750000
max          10.600000  122392.000000

In [10]:
sal.shape

(30, 2)

In [11]:
sal.isnull().sum()

YearsExperience    0
Salary             0
dtype: int64

# Linear Regression

In [14]:
X = sal['YearsExperience']
y = sal['Salary']

In [16]:
#train-test split
X_train, X_test, y_train, y_test = train_test_split(X, y, train_size=0.7, random_state=100)

In [18]:
X_train_lm = X_train.values.reshape(-1,1)
X_test_lm = X_test.values.reshape(-1,1)

In [19]:
#model building
lm = LinearRegression()
lm.fit(X_train_lm,y_train)

LinearRegression()

In [25]:
#check the params
print(lm.coef_)
print(lm.intercept_)

[9731.20383825]
24230.76740233037

In [22]:
#make predictions on test and training set
y_train_pred = lm.predict(X_train_lm)
y_test_pred = lm.predict(X_test_lm)

In [24]:
#evaluate model on training and test set
print(r2_score(y_true=y_train, y_pred=y_train_pred))
print(r2_score(y_true=y_test, y_pred=y_test_pred))

0.9489148127897334
0.9627668685473266

### The model is highly accurate